<h3>For Loop</h3> // ตัวอย่างการใช้ For Loop ใน PHP
<?php
for ($i = 0; $i <= 10; $i++) { // เริ่มต้นที่ 0, ทำซ้ำจนถึง 10, เพิ่มค่า $i ทีละ 1
    echo $i; // แสดงตัวเลขจาก 0 ถึง 10
}
?>

<h3>While Loop</h3>
<?php
$i = 0; // กำหนดค่าเริ่มต้นของตัวแปร $i เป็น 0
while ($i <= 10) { // ทำซ้ำตราบใดที่ $i น้อยกว่าหรือเท่ากับ 10
    echo $i; // แสดงตัวเลขปัจจุบันของ $i
    $i++; // เพิ่มค่า $i ทีละ 1
}
?>

<h3>Do While Loop</h3>
<?php
$i = 0; // กำหนดค่าเริ่มต้นของตัวแปร $i เป็น 0
do {
    echo $i; // แสดงตัวเลขปัจจุบันของ $i
    $i++; // เพิ่มค่า $i ทีละ 1
} while ($i < 10); // ทำซ้ำตราบใดที่ $i น้อยกว่าหรือเท่ากับ 10